app/controllers/places_controller.rb

	def index
		@place = Place.all
---
SELECT "places".* FROM "places"

	def show
		@place = Place.find_by(:title => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = 'Wildberry Pancake and Cafe' LIMIT 1

	def delete
		deleted_place = Place.find_by(:title => params["id"])
		deleted_place.delete
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = 'Wildberry Pancake and Cafe' LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 6

    def create
    	Place.create(:title => params["title"], :photo_url => params["photo_url"], :admission_price => params["admission_price"], :description => params["description"])
---
INSERT INTO "places" ("description", "photo_url", "title") VALUES (?, ?, ?)  [["description", " Description goes here."], ["photo_url", ""], ["title", "12"]]

    def edit
    #	render "edit"
        @place = Place.find_by(:title => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = ':id' LIMIT 1

    def update
    	@place = Place.find_by(:title => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = ':id' LIMIT 1